<a href="https://colab.research.google.com/github/apadkavyrava/Contextual-text-parsing-/blob/master/data_collection.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Cities dataset came from Kaggle in csv format with 15000 rows

In [0]:
import pandas as pd

cities_raw = pd.read_csv('cities15000.csv', encoding='latin1')
cities_raw.head() 
cities_t = pd.DataFrame(data = cities_raw['asciiname'])
cities_t.columns = ['Words']
cities_t.head(15)
cities_t.insert(1, 'Label', 'LOC') 
cities_t.head()

              Words Label
0      les Escaldes   LOC
1  Andorra la Vella   LOC
2    Umm al Qaywayn   LOC
3    Ras al-Khaimah   LOC
4      Khawr Fakkan   LOC

Countries and territiries.

In [0]:
countries_raw = pd.read_csv('countries of the world.csv')
countries_raw.head(3)

        Country                               Region  ...  Industry  Service
0  Afghanistan         ASIA (EX. NEAR EAST)           ...      0,24     0,38
1      Albania   EASTERN EUROPE                       ...     0,188    0,579
2      Algeria   NORTHERN AFRICA                      ...       0,6    0,298

[3 rows x 20 columns]

In [0]:
#interesting in Country and Region
country_t = pd.DataFrame(data = countries_raw['Country'])
country_t.columns = ['Words']
country_t.insert(1, 'Label', 'LOC') 
country_t.head()
countries_raw['Region'].unique()

array(['ASIA (EX. NEAR EAST)         ',
       'EASTERN EUROPE                     ',
       'NORTHERN AFRICA                    ',
       'OCEANIA                            ',
       'WESTERN EUROPE                     ',
       'SUB-SAHARAN AFRICA                 ', 'LATIN AMER. & CARIB    ',
       'C.W. OF IND. STATES ', 'NEAR EAST                          ',
       'NORTHERN AMERICA                   ',
       'BALTICS                            '], dtype=object)

In [0]:
#not enough for regions. Use diff dataset
region_raw = pd.read_csv('countries-geographical-territory-containment-csv_csv.csv')
region_raw.head()

   Region_Code  ... Developed_Or_Developing_Countries
0            2  ...                        Developing
1            2  ...                        Developing
2            2  ...                        Developing
3            2  ...                        Developing
4            2  ...                        Developing

[5 rows x 13 columns]

In [0]:
#we are interesting in Region_Name and Sub_Region_Name
import numpy as np
region_t1 = pd.DataFrame(data = region_raw['Region_Name'].unique())
region_t1.columns = ['Words']
region_t1.insert(1, 'Label', 'LOC') 
sub_region_t = pd.DataFrame(data = region_raw['Sub_Region_Name'].unique())
sub_region_t.columns = ['Words']
sub_region_t.insert(1, 'Label', 'LOC') 
fr = [region_t1, sub_region_t]
region_t = pd.concat(fr)
region_t.dropna(inplace=True)
region_t.head(5)

      Words Label
0    Africa   LOC
1  Americas   LOC
3      Asia   LOC
4    Europe   LOC
5   Oceania   LOC

Famous object.

In [0]:
import requests
from bs4 import BeautifulSoup
f_place = pd.DataFrame()
for page in range(1, 8):
  r= requests.get('https://www.listchallenges.com/top-250-famous-attractions-in-the-world/list/{}'.format(page))
  soup = BeautifulSoup(r.text, 'html.parser')
  obj_list = [object.text.strip() for object in soup.select('div.item-name')]
  f_place = f_place.append(obj_list)
f_place.columns = ['Words']
f_place.insert(1, 'Label', 'LOC') 
print(f_place)

                            Words Label
0             Great Wall of China   LOC
1               Statue of Liberty   LOC
2                    Eiffel Tower   LOC
3                         Big Ben   LOC
4              Sydney Opera House   LOC
..                            ...   ...
5         Great Blue Hole, Belize   LOC
6   Tigers Nest Monastery, Bhutan   LOC
7     Gullfoss Waterfall, Iceland   LOC
8                      Halong Bay   LOC
9                 Antelope Canyon   LOC

[250 rows x 2 columns]

Componies. Used two datasets - 1000 the most profitable and 1000 charities or non profitable companies.

In [0]:
pro_com = pd.read_csv('Forbes Top2000.csv')
non_pro_com = pd.read_csv('eo_pr.csv')
fr_pro = pd.DataFrame(data = pro_com['Company'])
fr_pro.columns = ['Words']
fr_pro.insert(1, 'Label', 'ORG') 
fr_non_pro = pd.DataFrame(data = non_pro_com['NAME'])
fr_non_pro.columns = ['Words']
fr_non_pro.insert(1, 'Label', 'ORG')
temp_list = [fr_pro, fr_non_pro]
companies_t = pd.concat(temp_list)
companies_t.head(5)

                     Words Label
0                     ICBC   ORG
1  China Construction Bank   ORG
2       Berkshire Hathaway   ORG
3           JPMorgan Chase   ORG
4              Wells Fargo   ORG

Used generator of abstract words, get the lits of excel.

In [0]:
import pandas as pd

ab_word = pd.read_excel('abstract-nouns.xlsx')
abstract_t = pd.DataFrame(data = ab_word)
abstract_t.columns = ['Words']
abstract_t.insert(1, 'Label', 'OTH')
abstract_t.head()

         Words Label
0    Happiness   OTH
1  Discordance   OTH
2        Agony   OTH
3     Ugliness   OTH
4      Torment   OTH

Random strings. Use random generators.

In [0]:
import pandas as pd
rand_st = pd.read_excel('random_string.xlsx')
random_t = pd.DataFrame(data=rand_st)
random_t.columns = ['Words']
random_t.insert(1, 'Label', 'RAN')
random_t.head()

          Words Label
0  vJRgdxFKM6MJ   RAN
1  wXQq37sQwrDM   RAN
2  ncUfTccL7KgV   RAN
3  QemzuByjYjJC   RAN
4  bxaX8fLeGqHr   RAN

Dates.

In [0]:
import pandas as pd
dates = pd.read_excel('random_string.xlsx', sheet_name = 'Sheet2')
Dates_t = pd.DataFrame(data = dates)
Dates_t.columns = ['Words']
Dates_t.insert(1,'Label','DATE')
Dates_t.tail(5)

                   Words Label
469  1984-02-26 00:00:00  DATE
470  1989-05-28 00:00:00  DATE
471  1989-07-29 00:00:00  DATE
472  1996-09-10 00:00:00  DATE
473  2002-12-28 00:00:00  DATE

Goods

In [0]:
import pandas as pd

g_data = pd.read_excel('physical-goods.xlsx')
goods_t = pd.DataFrame(data = g_data)
goods_t.columns = ['Words']
goods_t.insert(1, 'Label', 'PRODUCT')
goods_t.head()

        Words    Label
0     bedding  PRODUCT
1       duvet  PRODUCT
2      throws  PRODUCT
3     blanked  PRODUCT
4  bed spread  PRODUCT

In [0]:
data_temp = [cities_t,country_t, region_t, f_place, companies_t, abstract_t, random_t, Dates_t, goods_t]
data_t = pd.concat(data_temp)
data_t.sample(frac=1)
data_t.to_csv('ready_to_use.csv', index = False)
data_t.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30330 entries, 0 to 616
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Words   30330 non-null  object
 1   Label   30330 non-null  object
dtypes: object(2)
memory usage: 710.9+ KB